kinx-project/mk66f-fw/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTA14 (pin 66) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_TX_PORT, BOARD_INITPINS_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);

    /* PORTA15 (pin 67) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_RX_PORT, BOARD_INITPINS_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);

    /* PORTA24 (pin 75) is configured as PTA24 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_0_PORT, BOARD_INITPINS_ROW_0_PIN, kPORT_MuxAsGpio);

    /* PORTA25 (pin 76) is configured as PTA25 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_9_PORT, BOARD_INITPINS_ROW_9_PIN, kPORT_MuxAsGpio);

    /* PORTA26 (pin 77) is configured as PTA26 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_MIN_PORT, BOARD_INITPINS_ROW_MIN_PIN, kPORT_MuxAsGpio);

    /* PORTA27 (pin 78) is configured as PTA27 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_7_PORT, BOARD_INITPINS_ROW_7_PIN, kPORT_MuxAsGpio);

    /* PORTA28 (pin 79) is configured as PTA28 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_8_PORT, BOARD_INITPINS_ROW_8_PIN, kPORT_MuxAsGpio);

    /* PORTA29 (pin 80) is configured as PTA29 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_6_PORT, BOARD_INITPINS_ROW_6_PIN, kPORT_MuxAsGpio);

    /* PORTB23 (pin 102) is configured as PTB23 */
    PORT_SetPinMux(BOARD_INITPINS_LED_NUMPAD_PORT, BOARD_INITPINS_LED_NUMPAD_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 103) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_LED_SCROLL_LOCK_PORT, BOARD_INITPINS_LED_SCROLL_LOCK_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 104) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_LED_NUM_LOCK_PORT, BOARD_INITPINS_LED_NUM_LOCK_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 105) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_LED_CAPS_LOCK_PORT, BOARD_INITPINS_LED_CAPS_LOCK_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 109) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_5_PORT, BOARD_INITPINS_ROW_5_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 110) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_4_PORT, BOARD_INITPINS_ROW_4_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_3_PORT, BOARD_INITPINS_ROW_3_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 112) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_2_PORT, BOARD_INITPINS_ROW_2_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_1_PORT, BOARD_INITPINS_ROW_1_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_EQL_PORT, BOARD_INITPINS_ROW_EQL_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 127) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_COL0_PORT, BOARD_INITPINS_COL0_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD1 (pin 128) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_COL1_PORT, BOARD_INITPINS_COL1_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD2 (pin 129) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_COL2_PORT, BOARD_INITPINS_COL2_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[2] = ((PORTD->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD3 (pin 130) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_COL3_PORT, BOARD_INITPINS_COL3_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[3] = ((PORTD->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD4 (pin 131) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_COL4_PORT, BOARD_INITPINS_COL4_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[4] = ((PORTD->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD5 (pin 132) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_COL5_PORT, BOARD_INITPINS_COL5_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[5] = ((PORTD->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD6 (pin 133) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_COL6_PORT, BOARD_INITPINS_COL6_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[6] = ((PORTD->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTD7 (pin 136) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_ESC_PORT, BOARD_INITPINS_ROW_ESC_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_F1_PORT, BOARD_INITPINS_ROW_F1_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 138) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_ROW_F2_PORT, BOARD_INITPINS_ROW_F2_PIN, kPORT_MuxAsGpio);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK)))

                  /* UART 0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
